requests/request-th.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://salesforce.com/th/invoice-web-service">

   <soapenv:Header/>
   <soapenv:Body>
      <gs:billProjectRequest>
         <gs:project>
		<gs:username>rajdeep</gs:username>
		<gs:password>trailhead</gs:password>
		<gs:projectid>12345</gs:projectid>
	        <gs:billAmount>1000</gs:billAmount>
	</gs:project>
      </gs:billProjectRequest>
   </soapenv:Body>
</soapenv:Envelope>


